Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.2.52/samv70b/atdf/ATSAMV70Q20B.atdf
    <module name="EBI" caption="External Bus Interface"/>
    <module name="EFC" caption="Embedded Flash Controller" id="6450" version="Y">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
          <bitfield caption="Unique ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00010000" name="UECCELSB"/>
          <bitfield caption="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00020000" name="MECCELSB"/>
          <bitfield caption="Unique ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00040000" name="UECCEMSB"/>
          <bitfield caption="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00080000" name="MECCEMSB"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
        <register caption="Write Protection Mode Register" name="EEFC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="EEFC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
      <value-group caption="" name="EEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
      <value-group caption="" name="EEFC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x454643"/>
      </value-group>
    </module>
    <module name="GPBR" caption="General Purpose Backup Registers" id="6378" version="J">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR" offset="0x0" rw="RW" size="4" count="8">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module name="HSMCI" caption="High Speed MultiMedia Card Interface" id="6449" version="R">
      <register-group name="HSMCI">
        <register caption="Control Register" name="HSMCI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Multi-Media Interface Enable" mask="0x00000001" name="MCIEN"/>
          <bitfield caption="Multi-Media Interface Disable" mask="0x00000002" name="MCIDIS"/>
          <bitfield caption="Power Save Mode Enable" mask="0x00000004" name="PWSEN"/>
          <bitfield caption="Power Save Mode Disable" mask="0x00000008" name="PWSDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="HSMCI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x000000FF" name="CLKDIV"/>
          <bitfield caption="Power Saving Divider" mask="0x00000700" name="PWSDIV"/>
          <bitfield caption="Read Proof Enable" mask="0x00000800" name="RDPROOF"/>
          <bitfield caption="Write Proof Enable" mask="0x00001000" name="WRPROOF"/>
          <bitfield caption="Force Byte Transfer" mask="0x00002000" name="FBYTE"/>
          <bitfield caption="Padding Value" mask="0x00004000" name="PADV"/>
          <bitfield caption="Clock divider is odd" mask="0x00010000" name="CLKODD"/>
        </register>
