Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.2.52/samv70b/atdf/ATSAMV70Q20B.atdf
            <value-group name="SKEW">
                <value value="0" name="VALUE_0" caption="10ms calibration value is exact"/>
                <value value="1" name="VALUE_1" caption="10ms calibration value is inexact, because of the clock frequency"/>
            </value-group>
            <value-group name="NOREF">
                <value value="0" name="VALUE_0" caption="The reference clock is provided"/>
                <value value="1" name="VALUE_1" caption="The reference clock is not provided"/>
            </value-group>
        </module>
    <module name="NVIC" caption="Nested Vectored Interrupt Controller">
            <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
                <register offset="0x00000000" size="4" name="ISER" count="8" initval="0" caption="Interrupt Set Enable Register n">
                    <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
                </register>
                <register offset="0x00000080" size="4" name="ICER" count="8" initval="0" caption="Interrupt Clear Enable Register n">
                    <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
                </register>
                <register offset="0x00000100" size="4" name="ISPR" count="8" initval="0" caption="Interrupt Set Pending Register n">
                    <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
                </register>
                <register offset="0x00000180" size="4" name="ICPR" count="8" initval="0" caption="Interrupt Clear Pending Register n">
                    <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
                </register>
                <register offset="0x00000200" size="4" name="IABR" count="8" initval="0" caption="Interrupt Active bit Register n">
                    <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
                </register>
                <register offset="0x00000300" size="1" name="IP" count="240" initval="0" caption="Interrupt Priority Register (8Bit wide) n">
                    <bitfield mask="0x000000ff" name="PRI0" caption="Priority of interrupt 0"/>
                </register>
                <register offset="0x00000e00" size="4" name="STIR" initval="0" rw="W" caption="Software Trigger Interrupt Register">
                    <bitfield mask="0x000001ff" name="INTID" caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
                </register>
            </register-group>
        </module>
    <module name="MPU" caption="Memory Protection Unit">
            <register-group name="MPU" caption="Memory Protection Unit Registers">
                <register offset="0x00000000" size="4" name="TYPE" initval="0x00001000" caption="MPU Type Register">
                    <bitfield mask="0x00000001" name="SEPARATE" caption="Indicates support for unified or separate instruction and date memory maps."/>
                    <bitfield mask="0x0000FF00" name="DREGION" caption="Indicates the number of supported MPU instruction regions."/>
                    <bitfield mask="0x00FF0000" name="IREGION" caption="Indicates the number of supported MPU data regions."/>
                </register>
                <register offset="0x00000004" size="4" name="CTRL" initval="0x00000000" caption="MPU Control Register">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
                    <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
                    <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
                </register>
                <register offset="0x00000008" size="4" name="RNR" caption="MPU Region Number Register">
                    <bitfield mask="0x000000FF" name="REGION" caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
                </register>
                <register offset="0x0000000C" size="4" name="RBAR" caption="MPU Region Base Address Register">
                    <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
                    <bitfield mask="0x00000010" name="VALID" caption="MPU Region Number valid bit."/>
                    <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
                </register>
                <register offset="0x00000010" size="4" name="RASR" caption="MPU Region Attribute and Size Register">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
                    <bitfield mask="0x0000003E" name="SIZE" caption="Specifies the size of the MPU protection region."/>
                    <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
                    <bitfield mask="0x00010000" name="B" caption="MPU access permission attributes."/>
                    <bitfield mask="0x00020000" name="C" caption="MPU access permission attributes."/>
                    <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
                    <bitfield mask="0x00380000" name="TEX" caption="MPU access permission attributes."/>
                    <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
                    <bitfield mask="0x10000000" name="XN" caption="Instruction access disable bit."/>
                </register>
                <register offset="0x00000014" size="4" name="RBAR_A1" caption="MPU Alias 1 Region Base Address Register">
                </register>
                <register offset="0x00000018" size="4" name="RASR_A1" caption="MPU Alias 1 Region Attribute and Size Register">
                </register>
                <register offset="0x0000001c" size="4" name="RBAR_A2" caption="MPU Alias 2 Region Base Address Register">
                </register>
                <register offset="0x00000020" size="4" name="RASR_A2" caption="MPU Alias 2 Region Attribute and Size Register">
                </register>
                <register offset="0x00000024" size="4" name="RBAR_A3" caption="MPU Alias 3 Region Base Address Register">
                </register>
                <register offset="0x00000028" size="4" name="RASR_A3" caption="MPU Alias 3 Region Attribute and Size Register">
                </register>
                
            </register-group>
        </module>
    <module name="FPU" caption="Floating Point Unit">
            <register-group name="FPU" caption="Floating Point Unit Registers">
                <register offset="0x00000004" size="4" name="FPCCR" initval="0xC0000000" caption="Floating-point Context Control Register">
                    <bitfield mask="0x00000001" name="LSPACT" caption="Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred."/>
                    <bitfield mask="0x00000002" name="USER" caption="Privilege level was user when the floating-point stack frame was allocated."/>
                    <bitfield mask="0x00000008" name="THREAD" caption="Mode was Thread Mode when the floating-point stack frame was allocated."/>
                    <bitfield mask="0x00000010" name="HFRDY" caption="Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated."/>
                    <bitfield mask="0x00000020" name="MMRDY" caption="MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated."/>
                    <bitfield mask="0x00000040" name="BFRDY" caption="BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated."/>
                    <bitfield mask="0x00000100" name="MONRDY" caption="DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated."/>
                    <bitfield mask="0x40000000" name="LSPEN" caption="Enable automatic lazy state preservation for floating-point context."/>
                    <bitfield mask="0x80000000" name="ASPEN" caption="Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit."/>
                </register>
                <register offset="0x00000008" size="4" name="FPCAR" caption="Floating-point Context Address Register">
                    <bitfield mask="0xFFFFFFF8" name="ADDRESS" caption="The location of the unpopulated floating-point register space allocated on an exception stack frame."/>
                </register>
                <register offset="0x0000000C" size="4" name="FPDSCR" initval="0x00000000" caption="Floating-point Default Status Control Register">
                    <bitfield mask="0x00C00000" name="RMode" caption="Default value for FPSCR.RMode."/>
                    <bitfield mask="0x01000000" name="FZ" caption="Default value for FPSCR.FZ."/>
                    <bitfield mask="0x02000000" name="DN" caption="Default value for FPSCR.DN."/>
                    <bitfield mask="0x04000000" name="AHP" caption="Default value for FPSCR.AHP."/>
                </register>
                <register offset="0x00000010" size="4" name="MVFR0" initval="0x10110021" rw="R" caption="Media and VFP Feature Register 0">
                    <bitfield mask="0x0000000F" name="A_SIMD_registers" caption="Indicates the size of the FP register bank"/>
                    <bitfield mask="0x000000F0" name="Single_precision" caption="Indicates the hardware support for FP single-precision operations"/>
                    <bitfield mask="0x00000F00" name="Double_precision" caption="Indicates the hardware support for FP double-precision operations"/>
                    <bitfield mask="0x0000F000" name="FP_excep_trapping" caption="Indicates whether the FP hardware implementation supports exception trapping"/>
                    <bitfield mask="0x000F0000" name="Divide" caption="Indicates the hardware support for FP divide operations"/>
                    <bitfield mask="0x00F00000" name="Square_root" caption="Indicates the hardware support for FP square root operations"/>
                    <bitfield mask="0x0F000000" name="Short_vectors" caption="Indicates the hardware support for FP short vectors"/>
                    <bitfield mask="0xF0000000" name="FP_rounding_modes" caption="Indicates the rounding modes supported by the FP floating-point hardware"/>
                </register>
